---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblem1dNonWPCurve
source: html/fa1113f5-8ae4-d627-5058-4a7ff6582594.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblem1dNonWPCurve Property

Divided Surface cannot be split by a one dimensional curve without workplane

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSplitManagerProblem1dNonWPCurve { get; }
```